InformationRegisters/Расш6270_ОтложенныеЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Расш6270_ОтложенныеЗадания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/Расш6270_ПодпискиНаСобытия/Ext/Module.bsl
Процедура Расш6270_ДокументыОбработкаПроведенияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	// Вставить содержимое обработчика.
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.УстановкаЦенНоменклатуры") Тогда
		НоваяЗапись = РегистрыСведений.Расш6270_ОтложенныеЗадания.СоздатьМенеджерЗаписи();
		НоваяЗапись.Объект = Источник.Ссылка;
		НоваяЗапись.Событие = "УведомитьЯндексКарты";
		НоваяЗапись.Записать();
		
		НоваяЗапись = РегистрыСведений.Расш6270_ОтложенныеЗадания.СоздатьМенеджерЗаписи();
		НоваяЗапись.Объект = Источник.Ссылка;
		НоваяЗапись.Событие = "УведомитьРозница";
		НоваяЗапись.Записать();
		
		Если Источник.ДокументОснование <> Неопределено Тогда
			НоваяЗапись = РегистрыСведений.Расш6270_Состояние.СоздатьМенеджерЗаписи();
			НоваяЗапись.Объект = Источник.ДокументОснование;
			НоваяЗапись.Булево = Истина;
			НоваяЗапись.Записать();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры 

Процедура Расш6270_ОбработкаУведомлений() Экспорт
	НаборЗаписей = РегистрыСведений.Расш6270_ОтложенныеЗадания.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Запись.Событие = "УведомитьЯндексКарты" Тогда
			УведомитьОбИзмененииЗакупочныхЦенДляТоваровЯндексМаркета(Запись.Объект);
			
		ИначеЕсли  Запись.Событие = "УведомитьРозница" Тогда
			
			// Потом перепишу уведомление пока оно в модуле установки цен номенклатуры
			
		КонецЕсли;
	КонецЦикла; 
	НаборЗаписей.Очистить(); 
	НаборЗаписей.Записать();

КонецПроцедуры  

Процедура УведомитьОбИзмененииЗакупочныхЦенДляТоваровЯндексМаркета(ДокУстановкаЦен)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпрНоменклатура.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_НоменклатураЯндекс
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ГДЕ
		|	СпрНоменклатура.Расш6270_ShopSKU <> """"
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыТовары.Номенклатура.Расш6270_ShopSKU КАК НоменклатураРасш6270_ShopSKU,
		|	УстановкаЦенНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	УстановкаЦенНоменклатурыТовары.Цена КАК Цена,
		|	УстановкаЦенНоменклатурыТовары.Номенклатура.Наименование КАК НоменклатураНаименование
		|ПОМЕСТИТЬ ВТ_НоменклатураИзУстановкиЦен
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НоменклатураЯндекс КАК ВТ_НоменклатураЯндекс
		|		ПО (ВТ_НоменклатураЯндекс.Ссылка = УстановкаЦенНоменклатурыТовары.Номенклатура)
		|ГДЕ
		|	УстановкаЦенНоменклатурыТовары.ВидЦены = &ВидЦены
		|	И УстановкаЦенНоменклатурыТовары.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ПОМЕСТИТЬ ВТ_ЦенаСтарая
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&ДатаДоПроведения,
		|			(ВидЦены, Номенклатура) В
		|				(ВЫБРАТЬ
		|					&ВидЦены,
		|					ВТ_НоменклатураИзУстановкиЦен.Номенклатура
		|				ИЗ
		|					ВТ_НоменклатураИзУстановкиЦен)) КАК ЦеныНоменклатурыСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		
		|	ВТ_НоменклатураИзУстановкиЦен.НоменклатураРасш6270_ShopSKU КАК ShopSKU,
		|	ВТ_НоменклатураИзУстановкиЦен.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ВТ_ЦенаСтарая.Цена, 0) КАК ЦенаСтарая,
		|	ВТ_НоменклатураИзУстановкиЦен.Цена КАК Цена
		|ИЗ
		|	ВТ_НоменклатураИзУстановкиЦен КАК ВТ_НоменклатураИзУстановкиЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦенаСтарая КАК ВТ_ЦенаСтарая
		|		ПО ВТ_НоменклатураИзУстановкиЦен.Номенклатура = ВТ_ЦенаСтарая.Номенклатура";
	
	ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Закупочная");
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Ссылка", ДокУстановкаЦен);
	Запрос.УстановитьПараметр("ДатаДоПроведения", Новый Граница (ДокУстановкаЦен.Дата, ВидГраницы.Исключая));
	
	Выборка = Запрос.Выполнить();
	Если Выборка.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных =  Новый ОписаниеИсточникаДанных(Выборка);
	Построитель.Выполнить();
	Построитель.Вывести(ТабДок); 
	
	ВремФайл = ПолучитьИмяВременногоФайла(".xlsx");
	ТабДок.Записать(ВремФайл, ТипФайлаТабличногоДокумента.XLSX);
	
	Расш6270_Действия.ОтправитьДокумент(Константы.Расш6270_ТокенТелеграм.Получить(),
										Константы.Расш6270_ЧатЯндексМаркета.Получить(),
										Строка(ДокУстановкаЦен),
										ВремФайл); 
										
	Попытка УдалитьФайлы(ВремФайл);
	Исключение
	КонецПопытки;
	
	
КонецПроцедуры

Процедура Расш6270_СправочникиПриКопированииПриКопировании(Источник, ОбъектКопирования) Экспорт
	// Вставить содержимое обработчика.
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Номенклатура") Тогда
		СтеретьПриКопировании = Новый Структура;
		СтеретьПриКопировании.Вставить("Расш6270_ОсновнаяМодификация", 	Справочники.Номенклатура.ПустаяСсылка());
		СтеретьПриКопировании.Вставить("Расш6270_Недействителен", 		Ложь);
		СтеретьПриКопировании.Вставить("Расш6270_ВыгружатьНаСайт", 		Ложь);
		СтеретьПриКопировании.Вставить("Расш6270_ВыгружатьДляЯндекса", 	Ложь);
		СтеретьПриКопировании.Вставить("Расш6270_СтатусТовара", 	Ложь);
		СтеретьПриКопировании.Вставить("Расш6270_СезонныйТовар", 	Ложь);
		СтеретьПриКопировании.Вставить("Расш6270_ОсновнойПоставщик", 	Справочники.Контрагенты.ПустаяСсылка());
		СтеретьПриКопировании.Вставить("Расш6270_ShopSKU",				"");
		ЗаполнитьЗначенияСвойств(Источник, СтеретьПриКопировании);
	КонецЕсли;	
КонецПроцедуры
